src/Catalogs/Scan_КоммерческиеПредложения/Scan_КоммерческиеПредложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_КоммерческиеПредложения</name>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияКПSPORT</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКП</name>
    <type>
      <types>CatalogRef.Scan_СтатусыКПSPORT</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПродуктыКП</name>
    <attributes>
      <name>IDПродуктаКП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПродукта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПродуктаSPORT</name>
      <type>
        <types>CatalogRef.Scan_ТипыПродуктовКПSPORT</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Scan_СпецификацииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзделияПоПродуктам</name>
    <attributes>
      <name>IDПродуктаКП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDПродукта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_КоммерческиеПредложения/ManagerModule.bsl
//rarus vikhle 28.09.2020 mt 16181 +++
Процедура ОбновитьТабличныеЧастиКП (СсылкаНаИзделие) Экспорт
	
	Если НЕ ТипЗнч(СсылкаНаИзделие) = Тип("СправочникСсылка.Scan_Изделия") Тогда  //rarus vikhle 03.11.2020 mt 16181 убрал проверку на idпродуктакп
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	//rarus vikhle 02.11.2020 mt 16181 +++
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Scan_КоммерческиеПредложенияПродуктыКП.Ссылка КАК КП,
	//               |	Scan_КоммерческиеПредложенияПродуктыКП.IDПродуктаКП КАК IDПродуктаКППродуктыКП,
	//               |	Scan_КоммерческиеПредложенияИзделияПоПродуктам.Изделие КАК Изделие,
	//               |	Scan_КоммерческиеПредложенияИзделияПоПродуктам.НомерСтроки КАК НомерСтрокиИзделияПоПродуктам,
	//               |	Scan_КоммерческиеПредложенияИзделияПоПродуктам.IDПродукта КАК IDПродукта,
	//               |	Scan_КоммерческиеПредложенияИзделияПоПродуктам.IDПродуктаКП КАК IDПродуктаКПИзделияПоПродуктам
	//               |ИЗ
	//               |	Справочник.Scan_КоммерческиеПредложения.ПродуктыКП КАК Scan_КоммерческиеПредложенияПродуктыКП
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Scan_КоммерческиеПредложения.ИзделияПоПродуктам КАК Scan_КоммерческиеПредложенияИзделияПоПродуктам
	//               |		ПО Scan_КоммерческиеПредложенияПродуктыКП.IDПродуктаКП = Scan_КоммерческиеПредложенияИзделияПоПродуктам.IDПродуктаКП
	//               |ГДЕ
	//               |	Scan_КоммерческиеПредложенияПродуктыКП.IDПродуктаКП = &IDПродуктаКП
	//               |ИТОГИ ПО
	//               |	КП";
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_КоммерческиеПредложенияИзделияПоПродуктам.Ссылка КАК Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА Scan_КоммерческиеПредложенияИзделияПоПродуктам.Изделие = &СсылкаНаИзделие
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ИзделиеВходитВКП
	               |ПОМЕСТИТЬ КП
	               |ИЗ
	               |	Справочник.Scan_КоммерческиеПредложения.ИзделияПоПродуктам КАК Scan_КоммерческиеПредложенияИзделияПоПродуктам
	               |ГДЕ
	               |	Scan_КоммерческиеПредложенияИзделияПоПродуктам.Ссылка.НомерКП = &НомерКП
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Scan_КоммерческиеПредложенияИзделияПоПродуктам.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КП.Ссылка КАК Ссылка
	               |ИЗ
	               |	КП КАК КП
	               |ГДЕ
	               |	КП.ИзделиеВходитВКП = 0";
	Запрос.УстановитьПараметр("СсылкаНаИзделие",СсылкаНаИзделие);
	Запрос.УстановитьПараметр("НомерКП",СсылкаНаИзделие.НомерКП);
	//Запрос.УстановитьПараметр("IDПродуктаКП",СсылкаНаИзделие.IDПродуктаКП);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбъектКП = Выборка.Ссылка.ПолучитьОбъект();
			нСтрокаТЧ = ОбъектКП.ИзделияПоПродуктам.Добавить();
			нСтрокаТЧ.IDПродуктаКП = СсылкаНаИзделие.IDПродуктаКП;
			нСтрокаТЧ.IDПродукта = СсылкаНаИзделие.IDExternalSystemProduct;
			нСтрокаТЧ.Изделие = СсылкаНаИзделие;
			Попытка
				ОбъектКП.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("Обновление табличных частей КП",УровеньЖурналаРегистрации.Ошибка,,Выборка.КП,
										"Не удалось записать Коммерческое предложение " + Выборка.Ссылка +  " " + ОписаниеОшибки());
			КонецПопытки;	
		КонецЦикла;
	КонецЕсли;	
	
	//Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Пока Выборка.Следующий() Цикл
	//	ОбъектКП = Выборка.КП.ПолучитьОбъект();
	//	НужноЗаписатьКП = Ложь;
	//	ВыборкаДетальныеЗаписи = Выборка.Выбрать();
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		Если ВыборкаДетальныеЗаписи.IDПродуктаКПИзделияПоПродуктам = NULL Тогда
	//			нСтрокаТЧ = ОбъектКП.ИзделияПоПродуктам.Добавить();
	//			нСтрокаТЧ.IDПродуктаКП = ВыборкаДетальныеЗаписи.IDПродуктаКППродуктыКП;
	//			нСтрокаТЧ.IDПродукта = СсылкаНаИзделие.IDExternalSystemProduct;
	//			нСтрокаТЧ.Изделие = СсылкаНаИзделие;
	//			НужноЗаписатьКП = Истина;
	//			Прервать;
	//		ИначеЕсли ВыборкаДетальныеЗаписи.Изделие.Пустая() И ВыборкаДетальныеЗаписи.IDПродукта = СсылкаНаИзделие.IDExternalSystemProduct Тогда
	//			ОбъектКП.ИзделияПоПродуктам[ВыборкаДетальныеЗаписи.НомерСтрокиИзделияПоПродуктам - 1].Изделие = СсылкаНаИзделие;	
	//			НужноЗаписатьКП = Истина;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;	
	//	Если НужноЗаписатьКП Тогда
	//		Попытка
	//			ОбъектКП.Записать();
	//		Исключение
	//			ЗаписьЖурналаРегистрации("Обновление табличных частей КП",УровеньЖурналаРегистрации.Ошибка,,Выборка.КП,
	//									"Не удалось записать Коммерческое предложение " + Выборка.КП +  " " + ОписаниеОшибки());
	//		КонецПопытки;
	//	КонецЕсли;	
	//КонецЦикла;	
	//rarus vikhle 02.11.2020 mt 16181 ---
	
КонецПроцедуры
//rarus vikhle 28.09.2020 mt 16181 ---
